{
  "articles": [
    {
      "title": "Analyzing the President’s Five Pillars for Ghana’s Economic and Social Transformation",
      "slug": "analyzing-presidents-five-pillars",
      "excerpt": "An empirical assessment of the feasibility and impact of the new strategic framework for Ghana's transformation.",
      "content": "This assessment examines the President’s Five Pillars as a strategic framework for Ghana’s economic and social transformation as reported by the Daily Graphic, with the aim of evaluating their feasibility, coherence, and potential impact. It seeks to move beyond broad policy statements by grounding the pillars in empirical evidence, current economic realities, and institutional capacity.\n\nThe assessment draws on credible national and international data to analyze how each pillar aligns with Ghana’s development challenges, including fiscal constraints, unemployment, human capital gaps, governance weaknesses, environmental pressures, and social inclusion. It evaluates both the opportunities presented by the pillars and the structural bottlenecks that could limit effective implementation.\n\n1. A Productive and Diversified Economy\nGhana’s economic structure remains highly concentrated, making diversification an urgent necessity. According to the Ghana Statistical Service (GSS), agriculture, industry, and services contributed 21.3%, 32.4%, and 46.3% to GDP respectively in 2024, yet exports remain dominated by gold, cocoa, and oil, which together account for over 80% of export earnings. Manufacturing contributes less than 11% of GDP, well below the levels observed in peer emerging economies.\nProductivity growth is also weak; the World Bank estimates Ghana’s labour productivity growth at below 1.5% annually over the past decade. This constrains job creation despite positive GDP growth. Achieving this pillar therefore requires scaling industrial value addition, lowering energy and credit costs, and expanding SME access to finance particularly long-term capital if diversification is to translate into resilience and employment.\n\n2. Human Capital Development\nHuman capital outcomes in Ghana reveal a strong access–quality gap. While Free SHS has raised secondary school enrolment by over 30% since 2017, learning outcomes remain weak. The World Bank’s Human Capital Index (2023) places Ghana at 0.44, meaning a child born today will be only 44% as productive as they could be with full education and health.\nUnemployment among youth (15–35 years) stands at over 19%, with underemployment significantly higher, reflecting persistent skills mismatch. In health, Ghana spends about 3.2% of GDP, below the Abuja target of 15% of government expenditure, contributing to NHIS arrears and health worker emigration. Without stronger investment in TVET, skills alignment, and health system financing, the human capital pillar risks yielding limited economic returns.\n\n3. Good Governance and National Discipline\nGovernance weaknesses have been a central driver of Ghana’s fiscal distress. Public debt rose from 55% of GDP in 2019 to over 90% in 2023, prompting IMF intervention. The IMF Governance Diagnostic Assessment (2024) highlights vulnerabilities in procurement, SOE oversight, and asset declaration enforcement.\nCorruption-related inefficiencies are estimated by Transparency International and UNDP to cost Ghana 2–3% of GDP annually, equivalent to several billion cedis in lost public resources. While institutions such as the Auditor-General and OSP exist, enforcement remains uneven. This pillar can only be realized if fiscal rules are respected beyond IMF conditionality, procurement transparency is strengthened, and accountability institutions are insulated from political influence.",
      "imageUrl": "/assets/images/publications/presidents-five-pillars.jpeg",
      "author": "EGP Research Team",
      "categorySlug": "policy",
      "tags": [
        "Policy",
        "Economy",
        "Development",
        "Analysis"
      ],
      "publishedAt": "2026-01-08T00:00:00.000Z",
      "featured": true
    },
    {
      "title": "IMF Approves Fifth Review of Ghana Programme, Set to Release US$385 Million",
      "slug": "imf-approves-fifth-review-stabilisation-gains",
      "excerpt": "IMF Board completes fifth review, unlocking $385m disbursement as macroeconomic stabilization takes hold.",
      "content": "The Executive Board of the International Monetary Fund (IMF) has completed the fifth review of Ghana’s 39-month Extended Credit Facility (ECF) arrangement, approving the immediate disbursement of about US$385 million (SDR 267.5 million). This brings total IMF disbursements to Ghana to approximately US$2.8 billion under the US$3 billion programme approved in May 2023.",
      "imageUrl": "/assets/images/publications/imf-review-approval.jpeg",
      "author": "Abdulkarim Mohammed",
      "categorySlug": "imf",
      "tags": [
        "IMF",
        "Economy",
        "Fiscal Policy",
        "News"
      ],
      "publishedAt": "2025-12-19T00:00:00.000Z",
      "featured": true
    },
    {
      "title": "Bank of Ghana’s 350bps Rate Cut: What It Means for Ghana’s Economy",
      "slug": "bog-350bps-rate-cut-implications",
      "excerpt": "The MPC's bold 350bps rate cut signals a turning point for Ghana’s recovery. What does this mean for businesses and households?",
      "content": "The Monetary Policy Committee (MPC) of the Bank of Ghana has concluded its 127th meeting with a significant decision — a reduction in the Monetary Policy Rate (MPR) by 350 basis points, from 21.5% to 18%. This is the largest single cut in the current easing cycle and marks a turning point in Ghana’s macroeconomic recovery efforts.",
      "imageUrl": "/assets/images/publications/bog-rate-cut.jpg",
      "author": "EGP Research Team",
      "categorySlug": "economy",
      "tags": [
        "Monetary Policy",
        "BoG",
        "Interest Rates",
        "News"
      ],
      "publishedAt": "2025-11-28T00:00:00.000Z",
      "featured": true
    },
    {
      "title": "Fitch Projects MPR Drop to 16.5% by 2026; What It Means for Ghana",
      "slug": "fitch-projects-mpr-drop-16-5-2026",
      "excerpt": "Fitch Solutions forecasts further easing of Ghana's policy rate to 16.5% by 2026, contingent on sustained disinflation.",
      "content": "Fitch Solutions has projected that Ghana’s Monetary Policy Rate (MPR) could decline to 16.5% by 2026, signalling expectations of easing inflation pressures and a gradually stabilising macroeconomic environment.",
      "imageUrl": "/assets/images/publications/fitch-mpr-drop.jpeg",
      "author": "EGP Research Team",
      "categorySlug": "economy",
      "tags": [
        "Fitch",
        "Economy",
        "Projections",
        "News",
        "Analysis"
      ],
      "publishedAt": "2025-11-20T00:00:00.000Z",
      "featured": false
    },
    {
      "title": "EGP Participates in CSO Budget Forum Review of the 2026 National Budget",
      "slug": "egp-participates-cso-budget-forum-2026",
      "excerpt": "EGP joins CSOs to scrutinize the 2026 Budget, calling for realistic revenue targets and protection of social spending.",
      "content": "The Economic Governance Platform (EGP) joined other Civil Society Organisations (CSOs) at the Annual CSO Budget Forum to review and analyze the 2026 National Budget Statement and Economic Policy.",
      "imageUrl": "/assets/images/publications/cso-budget-forum.jpeg",
      "author": "EGP Communications",
      "categorySlug": "policy",
      "tags": [
        "Budget",
        "CSO",
        "Advocacy",
        "News"
      ],
      "publishedAt": "2025-11-18T00:00:00.000Z",
      "featured": false
    }
  ],
  "events": [
    {
      "title": "Launch of Public Debt Tracker and IMF Dashboard",
      "slug": "launch-of-public-debt-tracker-and-imf-dashboard",
      "description": "We unveiled our digital tools that allow citizens and stakeholders to monitor Ghana's public debt and IMF program implementation.",
      "location": "Accra, Ghana",
      "startDate": "2025-02-13T09:00:00.000Z",
      "endDate": "2025-02-13T12:00:00.000Z",
      "featured": true
    },
    {
      "title": "2025 EGP Member Strategic Meeting",
      "slug": "2025-egp-member-strategic-meeting",
      "description": "Our members gathered to set the strategic direction for 2025, focusing on strengthening fiscal transparency initiatives and advocacy work.",
      "location": "EGP Conference Room",
      "startDate": "2025-02-12T09:00:00.000Z",
      "endDate": "2025-02-12T17:00:00.000Z",
      "featured": false
    }
  ],
  "economicData": [],
  "staff": [
    {
      "name": "Beauty Emefa Narteh",
      "position": "Executive Secretary",
      "bio": "Beauty Emefa Narteh is the Executive Secretary of GACC...",
      "imageUrl": "/assets/images/staff/beauty-2.jpg",
      "email": null,
      "order": 1
    },
    {
      "name": "Abdulkarim Mohammed",
      "position": "Coordinator",
      "bio": "With more than eighteen (18) active years of hands-on experience...",
      "imageUrl": "/assets/images/staff/Adulkarim.jpeg",
      "email": null,
      "order": 2
    },
    {
      "name": "Ebenezer Otu Okley",
      "position": "Programmes Officer",
      "bio": "Ebenezer Otu Okley is a Programmes Officer at the Economic Governance Platform (EGP)...",
      "imageUrl": "/assets/images/staff/Eben.jpg",
      "email": null,
      "order": 3
    }
  ]
}